{
    "version": "https://jsonfeed.org/version/1",
    "title": "云帆",
    "description": "www.yun.fan yun.fan yun fan yunfan 云帆 云 雲 帆 舤 舧 云凡 䨶䬚 云舤 雲颿 雲舤 伝梵 云舧 letsgo letsgofun fun letsgo.fun www.letsgo.fun",
    "home_page_url": "http://yun.fan",
    "items": [
        {
            "id": "http://yun.fan/2024-09-18/golang%E7%8E%8B%E5%89%8D%E9%80%94%E5%85%B4/",
            "url": "http://yun.fan/2024-09-18/golang%E7%8E%8B%E5%89%8D%E9%80%94%E5%85%B4/",
            "title": "golang王前途兴",
            "date_published": "2024-09-17T22:44:57.000Z",
            "content_html": "<p>出一个golang语言相关的域名，golang.wang 可北岸 童叟无欺。</p>\n<p>下面是广告，也是实话实说，言者有意，听者可无心。</p>\n<span id=\"more\"></span>\n\n<p>如果你正在学习golang语言，但是苦于无用武之地，或者不知道怎么做才能学了能致用，而不是学习的时候什么都会，开始写东西的时候什么都不会了，那我就分享下我的学习之路。</p>\n<p>我比较喜欢折腾博客，所以会买golang相关的域名，当时是注册了 xuego.wang 也陆续买了letsgo 相关的，当时百度出了莱茨狗，以为站在了风口上，结果空欢喜一场。有了域名，然后就觉得师出有名了，会去github 上找博客相关的比较有名的开源项目或者不错的源码，然后克隆到本地，跑起来，然后根据自己的喜好，修改一些细节，最后放到外网，平时偶尔再发布几篇技术文章。这个过程是实战的过程，会遇到一些问题，然后一步步向前，向前。</p>\n<p>当时学lua还注册了一个imlua.vip，也是用openresty相关的源码搭建了一个博客。</p>\n<p>golang.ren 也是曾经我卖出的一个域名，然后里面都是golang相关的技术文章，刚才访问了下，阁中帝子今何在，很可惜。</p>\n<p>希望能有雄主纳此良才，助你斩将杀敌，封狼居胥。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-09-18/2024%E4%B8%AD%E7%A7%8B%E8%8A%82/",
            "url": "http://yun.fan/2024-09-18/2024%E4%B8%AD%E7%A7%8B%E8%8A%82/",
            "title": "2024中秋节",
            "date_published": "2024-09-17T22:44:57.000Z",
            "content_html": "<p>今天是2024年9月17号，农历中秋节，明天就要去上班了，放假三天，很快就要过去了，而我却未能留下只言片语，这怎么能行呢？</p>\n<span id=\"more\"></span>\n\n<p>这次没回家，主要是马上十一了，十一回家比较划算。此时此刻躺在床上，很有些燥热，顶层么，今天太阳挺大，所以家里很热，想着开空调，还是忍忍吧，这样的天气毕竟后面很少了，其实外面还是很凉快的，可是我不知道出去干啥。</p>\n<p>这个中秋，家里四个人，在三个地方度过，我漂泊北京，我大宝跟着她姑姑回山里老家了，体验农家乐生活了，我媳妇和小宝在县城家里，期待十一回家。</p>\n<p>最近总是有饥饿感，想吃点酸辣的东西，但是呢家里只有泡面，在好吃的零食，也代替不了一日三餐啊，自从点了几次外卖，我发现我有点喜欢上点外卖了，能吃到我喜欢吃的东西，而出去吃，周边没什么可吃的，能吃的饭馆越来越少了，今天还在，下次去就关门大吉了。好可惜啊，有一家拉面物美价廉，可惜装修还是怎么滴，去年至今一直也没见重开，真是怀念啊。</p>\n<p>在北京的日子，过的不累但是少了家人的陪伴，只能是单纯的打工赚钱了，没办法，不能两全。</p>\n<p>现在吃饭真的是一个大难题，出去了我不知道吃啥，这就是不吃肉的弊端了，能吃的爱吃的寥寥无几，最爱吃的油泼面，偏偏离得很远，要骑车20分钟才能到。</p>\n<p>那今天吃点啥呢？今天中秋节，本意是吃点好的犒劳下自己，但是我爱吃的就油泼面太远了。但是肚子已经饿了，那就走出去，总有去处。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-09-11/python%E8%84%9A%E6%9C%AC%E5%8C%96%E5%8F%91%E5%B8%83%E6%96%87%E7%AB%A0/",
            "url": "http://yun.fan/2024-09-11/python%E8%84%9A%E6%9C%AC%E5%8C%96%E5%8F%91%E5%B8%83%E6%96%87%E7%AB%A0/",
            "title": "python脚本化发布文章",
            "date_published": "2024-09-10T19:35:20.000Z",
            "content_html": "<p>今天是2024年9月10号，发工资的日子。发了工资，赶紧给我哥打过去上次说要给没给的钱，还要给家里的保姆发工资，一下所剩无几了。今天还干了一件谋划好久的事情。半自动化发布博客。</p>\n<span id=\"more\"></span>\n\n<p>我写博客一般是在手机的simplenote app  上写文字，然后这个app 各种端可以同步，然后我就可以在Mac上看到文章了。如是手动把文字copy 到hugo 的目录，然后scp 同步到我的服务器。这个流程，觉得最麻烦的点是，从simplenote 复制粘贴，有一天我发现simplenote 可以发布文章，然后得到一个链接，用这个链接可以打开文章，如是就想到了自动化处理。</p>\n<p>如是就写了python 脚本，从我的另一个博客抓取simplenote 的文章地址，然后写到hugo 的目录，然后执行scp ，都是代码来完成。</p>\n<p>我在simeplenote 写完文章，仅仅需要把文章对应的simplenote 地址发布用wordpress app 发布到xingren就行了，到时候代码会从xingren抓取地址，然后自动发布文章。</p>\n<p>还是有点小麻烦，后面看是否还有更好的办法，让发博客就像呼吸一样简单，像德芙一样丝滑。</p>\n<p>不得不感叹下，python抓取是真的好用。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-09-10/%E4%B8%80%E5%91%A8%E5%B9%B4%E7%BA%AA%E5%BF%B5/",
            "url": "http://yun.fan/2024-09-10/%E4%B8%80%E5%91%A8%E5%B9%B4%E7%BA%AA%E5%BF%B5/",
            "title": "一周年纪念",
            "date_published": "2024-09-10T00:27:18.000Z",
            "content_html": "<p>今天是2024年9月1号，星期六，一年前的今天，我历经千辛万苦，终于拿到了驾照，今日回首，依然觉得九死一生惊险万分。</p>\n<span id=\"more\"></span>\n\n<p>虽然拿到驾照一年了，但是期间我没有开过一次车，当然根本原因是我没车，如今还普通一个很长很长的线的风筝，还随风漂泊在北京，如果买车，一年估计也就开个2-3次，有点划不来，所以迟迟没有买车。</p>\n<p>当然我哥有车，曾经让我试着开，我拒绝了，一是我还没有做好准备害怕自己学艺不精，给人把车搞坏了，二是当时让我在高速上开，说这简单，我觉得要是在低速我还能勉强一试，高速太危险了，虽然我们走的那个高速车很少。</p>\n<p>很早前，我没有开车的打算，因为我觉得去那个地方，还得到处找停车的地方，是一件很麻烦的事情，觉得我这辈子可能不需要买车，所以也迟迟没有学驾照，但是现实中，几次让我觉得小地方没车是真的不方便，大城市公交地铁共享单车出租车网约车随便都行，小地方啥也没有，只能靠私家车，如是去年过年我在心中默默下了决心，今年去考驾照。</p>\n<p>我记得是过年收假回来，大概3月份吧，犹豫和调研了两周，终于下定决心报名了。</p>\n<p>从此我就走上了艰难的练车路，开始是他VR模拟练车，戴个眼镜，没一会就头昏脑胀，感觉好难，后面的学练习实车的时候，我深深感觉所谓的VR模拟，纯粹是浪费时间，这一点，公交驾校就比东方时尚好，实车练习才是王道。</p>\n<p>未来肯定还是要买车的，其实几次我想买车，媳妇说，一年就开几次，买了划不来，的确是这么回事。</p>\n<p>值此一周年之际，顺便回忆下当时的焦躁不安，内心折磨，自己终归不是一个凡遇大事有静气的人，不是泰山崩于前而色不变的人，虽然结果是成功，但是过程却是艰辛和些许耻辱，就像荆轲刺秦王，我是秦舞阳，终究还是慌乱了，不是荆轲，神勇之人，面不改色。事可以不成，但是心不能乱，可惜这是我这一辈子都无法企及的。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-09-10/%E5%8F%B9%E5%AE%8F%E5%9B%BE%E5%8F%88%E6%88%90%E7%A9%BA%E8%AF%9D/",
            "url": "http://yun.fan/2024-09-10/%E5%8F%B9%E5%AE%8F%E5%9B%BE%E5%8F%88%E6%88%90%E7%A9%BA%E8%AF%9D/",
            "title": "叹宏图又成空话",
            "date_published": "2024-09-09T22:36:32.000Z",
            "content_html": "<p>今天是2024年9月8号，星期日，准备下午去游泳，发现游泳虽然累，但是出来后，整个人神清气爽，好似一番苦战之后斩得敌军将领的项上人头凯旋而归，威加海内，扬眉吐气。</p>\n<a id=\"more\"></a>\n\n<p>前几天在网上看到有人发文，我读后感慨万千，也想在今日头条上一舒胸中抱负，可是昨天我尝试了下，发现泥牛入海，毫无音讯，于是我就心生退意，何必为了碎银几两而让自己套上枷锁，本来行文是件随心所欲的事情，是一件令人心旷神怡的事情，是能让我一吐胸中积郁的事情，何必让它有别的使命，既然没有那妙手著文章，就随遇而安，随风而逝，不求彪炳千秋，但能此时心安。</p>\n<p>有时候心里思绪万千，文思泉涌，感觉有很多事可以说，但是真的想下笔的时候，发现三言两语之后，就黔驴技穷，笔下羞涩，原本以为会轰轰烈烈曲折动人，却落得个平平无奇索然无味。</p>\n<p>但是我还是想尝试，之前想到了很多话题，我希望未来我会实现一二。</p>\n<p>我和我的花 </p>\n<p>概要:北漂十余年，有一盆绿萝跟了我十余年。几次辗转搬家，我都从未将她落下。</p>\n<p>我和我的兴趣爱好</p>\n<p>概要:乒乓球 羽毛球 游泳，甚至刚买了双截棍，希望能有所成就，当年也曾买过旱冰鞋，最后中途放弃，确切的说是一次后放弃，说中途言过其实。乒乓球这么多年一直竖拍，反手球束手无策，也分不清上旋下旋。游泳，不知道是蛙泳还是什么姿势的泳，不会踩水，深水区游过几次，再也不敢涉足其中。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-09-10/%E8%AE%A4%E6%B8%85%E8%87%AA%E5%B7%B1%E6%96%AD%E9%99%A4%E6%9D%82%E5%BF%B5/",
            "url": "http://yun.fan/2024-09-10/%E8%AE%A4%E6%B8%85%E8%87%AA%E5%B7%B1%E6%96%AD%E9%99%A4%E6%9D%82%E5%BF%B5/",
            "title": "认清自己断除杂念",
            "date_published": "2024-09-09T22:34:58.000Z",
            "content_html": "<p>今天是2024年9月2号，星期一，我娃今年上三年级了，今天和一个同事聊天，我是的娃是我们组年龄最大的，当然我年龄不是最大的。</p>\n<a id=\"more\"></a>\n\n<p>有时候会在人群中多看一眼，就心中有微末，如是行动上就会有微妙的变化，急于表现，害怕蕊寒香冷蝶难来，可是自己什么处境，几斤几两，这些小心思太不合时宜了。</p>\n<p>壁立千仞无欲乃刚，一些不切实际的杂念，只是自我感觉良好的错觉，何德何能，就安心走自己的平凡平庸路，不要奢求癞蛤蟆变金鳞，自己在属于自己的道路上可以放肆一些，一旦求而不得就会落得身败名裂，连最初的小路都没得走，就遗臭万年了。</p>\n<p>就像走在路上，路边有很多风景，看一眼就好，各自安好，各自高傲，如果迷恋就会堕入魔道，心不静身不正，如何潇洒，如何镇静，如何优雅。</p>\n<p>横眉冷对千夫指，俯首甘为孺子牛。只有心无杂念才能睥睨人间。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-31/%E6%B2%A1%E9%92%B1%E7%9A%84%E6%97%A0%E5%8A%A9/",
            "url": "http://yun.fan/2024-08-31/%E6%B2%A1%E9%92%B1%E7%9A%84%E6%97%A0%E5%8A%A9/",
            "title": "没钱的无助",
            "date_published": "2024-08-31T01:07:54.000Z",
            "content_html": "<p>没钱的无助</p>\n<p>今天是2024年8月31星期六，昨天晚上乒乓球从6.30打到8.30，中间吃了个饭，志得意满回家，结果看到了我爸让我给我哥转钱的微信，顿时心情就没那么愉快了。</p>\n<a id=\"more\"></a>\n\n<p>今年家里再盖房，去年过年在家的时候，大家一起讨论过这个问题，因为过年所有人都回家了，住的地方就有些捉襟见肘了，于是我也觉得有必要盖房。</p>\n<p>当时我的意思是，盖一层，因为其实就差几间房，再说我一年回老家的次数，也就2-3回吧，没必要搞那么多房间放那里，最近两年钱难挣啊，花费的话，我哥3万，我5万，我爸妈3万，结果现在房子完全是我哥随意发挥，当然他是搞装潢的，所以肯定比我比我爸都懂，现状是2层，又来了一个钢结构，房间还挺多的，说光窗户就安了九个。</p>\n<p>这次是要我再转3万，之前陆续也转了3万了。关键我现在银行卡里面活期的余额只有不到一万块钱。并不是说我没有3万块钱，好歹我也在北京也干了10多年的程序员了，只是最近银行利息降得厉害，所以我把活期都给存成定期了。</p>\n<p>而且我爸妈也没有出3万的意思，今天说了会出1万，这我也不好说什么，说我哥已经花了7万了，当然这也没啥账，每次我的钱转给他，都是他去开销的。</p>\n<p>因为我的钱不够一万，就让YY给我转了5000，暂时先给1W，后续的2万等发工资再给。虽然是向自己的媳妇要钱，但是感觉挺卑微的，这种感觉我很少有过，这还是向媳妇要，当然他的钱，也是我给的，要是要钱的对象换成别人，估计不仅卑微，还可能被拒绝。</p>\n<p>告诉自己，虽然舍不得，但是责任二字，让我不得不为之，作为儿子的责任，作为兄弟的责任。</p>\n<hr>\n<p>特别声明，此文发自 搁置多年的 MacPro 2015（2016年购买）</p>\n<p>这句话没别的意思，只是让我记得我这个老朋友，仍可一战。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-31/%E9%9A%BE%E6%88%90%E5%A4%A7%E5%99%A8/",
            "url": "http://yun.fan/2024-08-31/%E9%9A%BE%E6%88%90%E5%A4%A7%E5%99%A8/",
            "title": "难成大器",
            "date_published": "2024-08-31T01:04:55.000Z",
            "content_html": "<p>今天是2024年8月24号，星期六，明天是还信用卡的日子，又是3000多，感觉没花啥钱，到出账单的时候总感觉好多。</p>\n<a id=\"more\"></a>\n\n<p>之前看长风镖局里面一句话这么说的</p>\n<p>不能富贵，非因宿命只缘懒。<br>难成大器，既贪诗酒又恋花。</p>\n<p>而我的难成大器，却不是上面的理由，我觉得是性格格局造成的。</p>\n<p>我性格上，一直爱憎分明，眼里揉不得沙子，独来独往，不依附于人，也不想被人依附。</p>\n<p>我格局上，一直很小，不愿意放眼去看长远，就想着走稳脚下的路，无大志，无宏愿，也没有什么大的追求，平平庸庸，千千万万中一个普普通通的平常人，其貌不扬，小时候的贫穷让我心胸很是狭窄，见识少，本来就是没多少钱的事情，就能让我心生起伏。虽然现在自己自力更生了，有了一定的经济底蕴，但是这个弱点有所改善但是依然存在。</p>\n<p>说自己难成大器，不是自我贬低，而是自省吾身，但是也没有打算说去改变，都已经快40的人了，何必为难自己。</p>\n<p>欲让雄才惊满座，休将冷眼旁只我，青云剑，日月赏孤芒，蝇虫默。这只是电视剧里面爽文桥段，现实中，我平凡的如同一棵小草，无伟岸高枝，无灿烂花朵，但是因此而小看我，我只能说，竖子无谋，孰敢轻吾射！</p>\n<p>虽然不能说是漂泊半生，但是现在也是背井离乡，当年没有在北京买房子的能力，现在虽然有，但是却没了这个念头。</p>\n<p>路已经走了很远了，接下来，不用奔跑，缓缓前行即可。</p>\n<p>莫听穿林打叶声，何妨吟啸且徐行，竹杖芒鞋轻胜马，一蓑烟雨任平生。</p>\n<p>人生在世不称意，明朝散发弄扁舟。总之就是，可以不成大器，但是不要苦了自己，该坚持的继续坚持，该放纵的时候不要自惭形秽。</p>\n<hr>\n<p>此文发自 搁置多年的 MacPro 2015（2016年购买）</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-31/JUST-GO-RUN/",
            "url": "http://yun.fan/2024-08-31/JUST-GO-RUN/",
            "title": "JUST GO RUN",
            "date_published": "2024-08-31T01:02:25.000Z",
            "content_html": "<p>justgo.run 是我的一个域名，当初看上了keep.run，无奈太贵了，最后又各种安慰自己里，这个域名也一般，最后我就逐渐对这个域名没有难么痴心了。</p>\n<a id=\"more\"></a>\n<p>后来就退而求其次，自己注册了一个justgorun ，为了激励自己能去运动，确切的说是去跑步。</p>\n<p>前前后后我也坚持了一阵子，说效果吧，有，但是有限，虽然坚持了有一阵子了，但是在时间和距离上，基本上是原地踏步。</p>\n<p>好几次刷小视频，看到说自己多少岁跑步多久，可是一看脸，明显比实际年龄大很多，评论里一片哗然，都说跑步能让人显老，变老的更快。</p>\n<p>说人的心脏就像发动机，用的越多废的越早。说乌龟就是因为不动所以有千年王八之说。<br>也有人说就像车一样，也有公里数。</p>\n<p>看的我是心绪不宁，我这坚持有意义么？虽然跑步的目的，有一个不可告人的理由，但是如果让人老的更快，那我就心里打鼓了，本来已经垂垂老矣，如果再因为跑步适得其反的话，我就不知道何去何从了。</p>\n<p>抛开上面的未知之谜，有一点我是肯定的，跑步能让人变的轻盈，不至于腿像注了水银一样，举步维艰。</p>\n<p>不管有没有副作用，我觉得可以适当的减少一些，虽然跑步有时候也是一种享受，可以说痛并快乐着，毕竟还有痛。</p>\n<p>或许我的半头白发和这个有关系？心未老，鬓已秋。为此我在网上专门搜索了 跑步能加速衰老么？</p>\n<p>网上医生的结论，百分之95以上都说不会，说会的，也只是说过度跑步，会让一些器官受损从而加快衰老。</p>\n<p>所以我就当是不能了，抖音上看到的，也许是故意为之，为的就是让大家觉得不可思议而去讨论，如此那就 跑自己的路，让别人说去吧。</p>\n<hr>\n<p>特别声明，此文发自 搁置多年的 MacPro 2015（2016年购买）</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-23/%E6%9B%BE%E7%BB%8F%E7%9A%84%E5%BF%83%E5%8A%A8/",
            "url": "http://yun.fan/2024-08-23/%E6%9B%BE%E7%BB%8F%E7%9A%84%E5%BF%83%E5%8A%A8/",
            "title": "曾经的心动",
            "date_published": "2024-08-23T00:59:03.000Z",
            "content_html": "<p>今天是2024年8月16日，星期五，难得这个时间点能让自己停止去看抖音之类的，来这里写点什么。</p>\n<a id=\"more\"></a>\n\n<p>这里的心动不是对人，而是我域名。列举几个我曾经很喜欢的域名，但是时过境迁，对她们已经不复往日的喜欢了，所以以此为戒，买域名要深思熟虑，不要一时冲动。</p>\n<p>先说我已经被我据为己有的，zhan.ge dong.ge 当时买到手之后，发朋友圈说，东哥在手，天下我有，可最后也逐渐失宠，也有了很多新欢。xing.ren hello.men 也是后来归我麾下的。</p>\n<p>再说hello men，这个也是前后心动了好久最后没忍住买来了，现在看，也就那么回事，好在续费便宜，要不然就是一个烫手山芋。</p>\n<p>再来说忍住或者价钱太高没有买的，jiang.hu ，这个很早挺喜欢的，现在觉得一般，可能是这样的我见多了吧。keepmoving.cn 这个要3000块钱，最后还是忍住了，现在看，很一般，前面是英文单词，后缀是cn，品相很一般。</p>\n<p>还有shi.ci yun.lu keep.run mashangfenghou.com 应该还有很多，只是这会想不起来了，最近又相中了一个cn，问价了万元左右，高攀不起啊，所以写此文，总结经验，不要为冲动买单，不要等明年的此时，觉得买的不值当，手里的域名，已经不少了，不能再随随便便的增加新成员了。</p>\n<p>人很难坚持初心，走着走着就淡了，甚至忘了，不要在一些无关紧要或者自己一厢情愿的事情上费力费神费钱。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-23/%E9%92%B1%E8%B7%AF%E6%BC%AB%E6%BC%AB%E5%85%B6%E4%BF%AE%E8%BF%9C%E5%85%AE/",
            "url": "http://yun.fan/2024-08-23/%E9%92%B1%E8%B7%AF%E6%BC%AB%E6%BC%AB%E5%85%B6%E4%BF%AE%E8%BF%9C%E5%85%AE/",
            "title": "钱路漫漫其修远兮",
            "date_published": "2024-08-23T00:58:40.000Z",
            "content_html": "<p>今天是2024年8月11号，准备去游个泳。好久没去了，可能人会很多，但是害怕时间久了荒废了。</p>\n<a id=\"more\"></a>\n\n<p>我家二宝30多天了，感觉一路走来她妈挺不容易的。好不容易找了个阿姨，结果人家好了一段时间嫌路程远不干了，现在又换了一个是我家亲戚，好多话又不方便说。因为那个卧室没有空调，最近我买了空调，明天应该就可以装上了。</p>\n<p>用了两年多的宽带也要重新办理，之前用的我哥的手机号关联的，现在重新办了联通的了，49块一个月，还送160G流量，挺好的，解决了手机买流量的麻烦事情，现在手机不买流量卡根本不行，买个5个G的流量都得一个月20，移动是越来越坑。</p>\n<p>家房子后面有一天火车道，打开窗户就能看到火车疾驰而过，吵得很，就想把现在的窗子给换一下，换成隔音效果好的那种，两个窗户下来得个6-7千块钱，但是这个钱只要管用花的都值。</p>\n<p>比起小柠檬，这个娃母乳不足，就得搭配奶粉，这年头奶粉是真贵啊。或者说和小宝宝相关的东西都好贵啊。</p>\n<p>最近还买了空调，之前主卧安装了，现在给另一个房间也安装了，加上安装费200大概 2000块钱，之前那个买的奥克斯的，这个也买的这个牌子。之前那个买得早，是三级能耗，这次的是一级能耗，应该会省电一些。</p>\n<p>最近还想买手机，当然这个冲动一直都有，还是摁下这个不合时宜的想法。想买三星手机，现在这个安卓手机拍照不咋地，别的还行吧。估计下一个手机就是安卓的三星手机了，彻底和苹果手机告别了，虽然我现在还有个苹果12。当然这个不付诸行动主要是再买一个的话，就三个手机了，有点多了。</p>\n<p>当然想买域名的冲动一直都有，无奈太贵了，所以只好望洋兴叹了。</p>\n<p>还是穷啊，好多时候说对自己好一点，但是想买这些东西犒劳自己的时候还是舍不得。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-15/%E4%BA%8Cge%E6%BC%82%E6%B5%81%E8%AE%B0/",
            "url": "http://yun.fan/2024-08-15/%E4%BA%8Cge%E6%BC%82%E6%B5%81%E8%AE%B0/",
            "title": "二ge漂流记",
            "date_published": "2024-08-15T01:54:05.000Z",
            "content_html": "<p>今天是2024年7月10号，星期六，很久没有来这里一舒胸怀了。昨天刚下完雨，因为在顶层，所以经常听到雨落的声音。</p>\n<a id=\"more\"></a>\n\n<p>我的二哥，分别是东哥，占戈，很早之前，因为ge续费很贵，我就想找个便宜的注册商，有一次域名我都申请转出来了，结果付款的时候，卡住了，paypal没有钱，又没有全币种信用卡，所以只能不了了之。</p>\n<p>后来很久，此心不死，终于按耐不住行动了，于是就有了 一波三折的信用卡 这篇文章，既然信用卡到手了，那就干吧，不管花的钱多钱少，也算是一次尝试。当时犹豫的点是，不知道转入续费多钱，如果是50gel 格鲁吉亚，合着人民币130多块，其实比quyu.net 还贵，但是它续费两年是51gel ，所以总体看还是划算的。</p>\n<p>于是就拿zhange试手，结果第一次支付没有说失败，也没有说成功，感觉泥牛入海，为了保险起见，我查了交易流水，没有，不放心，问了客服，也没有，我就冒险再试一次，结果这次很轻松的就成功了，转入成功！</p>\n<p>而且花费是30gel，合着人民币肯定没有99块钱，然后我就又续费了两年，51gel，等于81gel 合计人民币217续费三年，比quyu.net 便宜了90块钱。</p>\n<p>本来想着dongge就放在quyu，最后还是没忍住，也这么来了一下，都漂泊海外了。</p>\n<p>算我的一次勇敢尝试，发现了新大陆。这样我的两个哥，就能长治久安了，最起码到2028年了。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-15/%E4%BB%A4%E6%88%91%E5%A4%B1%E6%9C%9B%E7%9A%84%E4%BA%B2%E6%83%85/",
            "url": "http://yun.fan/2024-08-15/%E4%BB%A4%E6%88%91%E5%A4%B1%E6%9C%9B%E7%9A%84%E4%BA%B2%E6%83%85/",
            "title": "令我失望的亲情",
            "date_published": "2024-08-15T01:53:45.000Z",
            "content_html": "<p>本来不想写这么不好的话题，但是我觉得还是记录下，令我失望，可能是我先令别人失望，所以大家各有千秋，也不必太耿耿于怀。</p>\n<a id=\"more\"></a>\n\n<p>第一次打电话，是我去医院的路上，在等车，那个时候已经住院了，我打电话想让我妈上来，结果我爸不能说是推三阻四，但是也是消极应对，还好我妈还是靠谱的，当天就上来了，我那个时候，应该也是给我哥打电话说了，结果娃出生好几天了，要不是我妹打电话给他说，估计我出院他都懒得开来。当然这我不能怪谁，因为人家也生娃了，我也没有干什么（当然这是我目前我的记忆，也许我也做了当时我该做的，我能做的，但是我忘记了）。</p>\n<p>前几天家里给我打电话我没有接着，最后我打回去的时候，闲谈了几句，得知家里现在没不忙。</p>\n<p>然后晚些时候，我就想，既然不忙，那就再上来帮忙几天吧，反正当时照顾月子然后我们出院我妈回家的时候说，后面可以再上来几天，其实说到照顾月子，我妈这次比较清闲，因为有保姆做饭，而我是最累的，熬了几个晚上，好几天都没有睡好觉，这个过程，也就我妹妹熬了两晚上，第一天晚上，柠檬第二天要考试，不愿意医院过夜，我就回去了。生娃的那天晚上，我和我妹都在医院呆了一晚上，所以从头到尾最累的是我。</p>\n<p>结果我打电话过去的时候，就各种理由说这几天不忙，后面就忙了之类的，说不是有阿姨之类的么？当时我是心里有气，但是我知道，虽然我认为这过分，但是到底还是求人呢，我就赶紧把电话挂了，我害怕我控制不住会发火，在我的概念里，父母帮子女带娃很普遍，我大娃就照顾了月子，这次是想帮忙照看几天，能让娃她妈稍微轻松点，经常睡不好觉。</p>\n<p>本以为事情就这么结束了，一波未平一波又起，保姆嫌弃每次上班太远，想让我们租房（当然之前是我主动提起过），因为租房的地方离她家很近，就三番五次这么说，最后我说暂时不考虑，因为租房的地方，没地遛娃，然后阿姨就可能觉得最后一丝希望破灭，就委婉表达了不想干的意思。</p>\n<p>知道这些，我赶紧再次给我妈打电话，我想让我妈来代替保姆，当然这么做，我肯定会给钱的，因为我妈对保姆挣这个钱可以说是眼红，说钱挣得太容易了，很想自己挣这个钱。所以我打电话确认，但是的确今年家里种了好多庄家，还养的有猪，在这个沟通过程中，我爸已经非常生气了，他理解的可能是上来帮忙，而我理解的是找保姆，他非常抵触不愿意，当然我也不知道是以为我不给钱白白上来帮忙生气还是就不愿意让我妈上来，我妈上来我爸的确不方便了，没人做饭，一个人干活。</p>\n<p>总之，不欢而散。情况就是我妈特别愿意挣这个钱，但是家里有农活，隔段时间得回去一趟，而且回去估计得十天半个月，这明显不行。</p>\n<p>我知道，这件事情，我可能自私了，仅仅站在我自己的位置思考问题，你家里的事是事，人家家里的事也是事啊。</p>\n<p>不管是我自私还是心胸狭隘，我估计短时间我不会忘记，也让我深刻体会到，人是自私的，哪怕是自己的父母子女，都没有自己重要。</p>\n<p>你用多少心对我，我也会用多少心对你，一路走来，我虽然没有按照你们预想中的给你们花钱啥的，但是每次回家我都买烟买一堆东西让我哥车带回去，平均一次花费都在500-800之间，每年过年也给1000。觉得一直在尽我作为儿子的责任。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-08-15/%E4%B8%80%E6%B3%A2%E4%B8%89%E6%8A%98%E7%9A%84%E4%BF%A1%E7%94%A8%E5%8D%A1/",
            "url": "http://yun.fan/2024-08-15/%E4%B8%80%E6%B3%A2%E4%B8%89%E6%8A%98%E7%9A%84%E4%BF%A1%E7%94%A8%E5%8D%A1/",
            "title": "一波三折的信用卡",
            "date_published": "2024-08-15T01:53:25.000Z",
            "content_html": "<p>今天是2024年7月30日，北京大雨，今天一天基本都在下大雨，还好我租房的地方不漏雨了。</p>\n<a id=\"more\"></a>\n\n<p>因为我的域名他  dong.ge zhan.ge 续费99一年，觉得有点贵，想转入到国外的平台，但是没有全币种信用卡，于是乎就想申请一张。</p>\n<p>本来我就有一张招商的visa信用卡，是双币种的，但是没法用，就申请了一张招商银行的全币种信用卡，审核很快通过，结果卡到了之后，我发现卡号有74这种号码，觉得不喜欢，我就找客服，客服说可以给作废，然后重新申请。</p>\n<p>我作废了，等我重新申请的时候，给我拒绝了，好吧，可能是短期内不能重复申请。其实我申请哪个银行的都能申请下来，但是想着两张信用卡一起管理方便一些，就没有去别的银行申请。</p>\n<p>上面的操作应该是6月份，反正肯定在6月17号之前，就是我回老家呆了一个月之前，最近我又试了下，居然审核通过了。</p>\n<p>接下来就是制卡然后给我邮寄，因为这个只要审核通过就能看到卡号的后四位了，发现还是74，我去尼玛的，算了吧，认了。</p>\n<p>然后7.26号说要给我配送，结果一直没配送，打了几次电话问快递员，都没有下文，最后找了招商银行的客服，说可以给我重新邮寄，好吧，然后卡号重新生成了，这次不再是74结尾了。</p>\n<p>一波三折的，最开始就不应该矫情了下，要不然都用上了。其实这个号码好与坏没啥，不像手机号码，经常示于人，这个基本不会有人知道，自己也不会记得，因为我的卡太多了，根本记不过来。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-07-23/%E8%89%B0%E9%9A%BE%E7%9A%84%E5%9B%9E%E4%BA%AC%E8%B7%AF/",
            "url": "http://yun.fan/2024-07-23/%E8%89%B0%E9%9A%BE%E7%9A%84%E5%9B%9E%E4%BA%AC%E8%B7%AF/",
            "title": "艰难的回京路",
            "date_published": "2024-07-23T01:31:15.000Z",
            "content_html": "<p>今天是2024年7月17号，计划今天回北京的，本来是晚上7点多的火车，结果半夜3点多12306发短信说停运了，然后计划就乱了。</p>\n<a id=\"more\"></a>\n\n<p>早上六点多醒了，就睡不着了，本来是买了12.50从柞水汽车站到西安火车站的，现在也担心高速也停运，这样就没法去西安了。</p>\n<p>一早看了下西安去北京的火车，有高铁没有停运，就果断买了高铁票，只不过这个高铁到北京西站已经晚上11.30了，没办法，为了那个未知的一个盼头，然后重新买了从柞水到西安的高速票，而且过了没多久，开始还很多票的，一会都没了，多亏下手的早。</p>\n<p>11点出发，耗时2个半小时到西安火车站，快到的时候，司机说他是最后一趟车，来的路上，有桥水已经漫道到路面上了，后面的车都不发了。我12306特意试了下，真的是这样，可以看到车次列表，但是没法购买了。</p>\n<p>现在在候车室等车，非常害怕一会收到短信说车次停运了。</p>\n<p>之前本来计划早一天去北京，结果自己也没有重视，期间下大雨，我也没有及时反应，导致真的到出发日了才开始着急，太被动了。</p>\n<p>西安火车站，好多车次都停运了，车站屏幕上一片红，哎，人算不如天算，凡事早做打算，万事要留一线，这样才能从容进退。这一点我做的已经不错了，但是这次还是大意了。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-06-29/2024%E5%B9%B46%E6%9C%88%E5%9B%9E%E5%AE%B6/",
            "url": "http://yun.fan/2024-06-29/2024%E5%B9%B46%E6%9C%88%E5%9B%9E%E5%AE%B6/",
            "title": "2024年6月回家",
            "date_published": "2024-06-29T02:33:01.000Z",
            "content_html": "<p>今天是2024年6月17号，不是什么节日，但是我还是在回家的火车上了。</p>\n<a id=\"more\"></a>\n\n<p>这次是下班之后直接从公司出发的，时间上稍显匆忙，但是其实还是比较充裕的。选择了动车的卧铺，貌似还是第一次坐，如果没记错的话。</p>\n<p>告诉自己要从容不迫，哪怕自己平凡平庸，但是这个应该一点都不妨碍我的从容。</p>\n<p>本来让我妈照顾我媳妇，结果我哥的一通话，虽然是酒后，但是还是让我改变了做法，其实道理不差，我还是对人情世故比较稚嫩。</p>\n<p>工作什么的，很重要，但是和有些事情比，还是逊色的，何况再多的努力，可能都是一样的结果，或者最差的结果我也能接受，所以该放手时就放手。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-06-29/%E7%AB%AF%E5%8D%88%E8%8A%82%E5%81%87%E6%9C%9F/",
            "url": "http://yun.fan/2024-06-29/%E7%AB%AF%E5%8D%88%E8%8A%82%E5%81%87%E6%9C%9F/",
            "title": "端午节假期",
            "date_published": "2024-06-29T02:32:43.000Z",
            "content_html": "<p>今天是2024年6月8号，星期六，端午节放假三天。今天是第一天。</p>\n<a id=\"more\"></a>\n\n<p>此时，我躺在护城河的一座大桥下，因为这里特别凉爽，亲着路上的车来车还有身后的啾啾鸟叫，刚才在另一个桥墩下面看见了一片草丛，长得真是郁郁葱葱，看着他们无忧无虑的样子，有时候觉得要是能做一株小草也挺不错的，当然我要长在那个护城河的桥下面，上面有遮风挡雨，又离旁边的人行道有一定的距离，不至于被人很轻易的踩踏，那么绿油油的随风摇曳，也是相当的惬意。</p>\n<p>今天我的右手小拇指受伤了，因为想停下来说几句话，但是停车的太着急，擦在了旁边的石墩上，当时看见了里面的白色，差点以为见着骨头了呢，紧接着开始冒血，像水一样，缓缓流出。过了一会儿，居然凝结住了，形成了一道惊艳的风景。本来想着明天或者后天有没有时间去游泳一次，这一下就彻底凉凉了。</p>\n<p>虽然我现在很惬意的躺在这个椅子上，但是我不得不准备回家了，因为我还没有吃中午饭。更关键的因素，是我这个破手机的电量已经不足了，出发的时候忘记了，我会在这里停留一段时间，应该带上另一个手机了，这样我就可以在这儿多呆会儿，这里看似喧闹却能让我异常平静，是一个好去处。</p>\n<p>心里还一直悬着一件工作上的事情，如果一旦有问题，可能会搞得我不得安宁，而且我感觉我毫无应对之法，这才是让我最担心的。但是好在我觉得多数应该不会有问题。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-06-29/%E5%90%AC%E5%AE%8C%E5%B0%81%E7%A5%9E%E6%A6%9C/",
            "url": "http://yun.fan/2024-06-29/%E5%90%AC%E5%AE%8C%E5%B0%81%E7%A5%9E%E6%A6%9C/",
            "title": "听完封神榜",
            "date_published": "2024-06-29T02:32:26.000Z",
            "content_html": "<p>今天是2024年5月26号，前一段时间在喜马拉雅听完了封神榜原著小说，有些感触，今天就发表点读后感。</p>\n<a id=\"more\"></a>\n\n<p>全书章节一百回，后面的有些章节我没有听，因为都是这个邓九公或者闻仲有人帮忙，姜子牙这边谁谁去被捉了，都是一样的套路。</p>\n<p>首先小说的文字没的说，用词古色古香，动不动有诗为证，好些对话也都铿锵有力掷地有声，但是故事情节也就那样吧。</p>\n<p>虽然好多神仙被封了神，他们也很不情愿，但是作为今天我觉得他们应该是考上了公务员拿上了铁饭，估计他们当时也没想到会是这样，要不然大家都真相赴死。</p>\n<p>我说的封神榜没什么意思，是因为啥呢？基本上就是打仗打仗然后打不过了找人，坏人打不过了就死掉了。姜子牙什么的被人打死了就有人来救，太多的主角光环就让人觉得太不可思议，而且破万仙阵，人家那些方外之人都说了，不要派那些虾兵蟹将来送死，但是呢？燃灯道人，可能是觉得劫数如此，那些人有自己的劫难，所以就让他们当炮灰去。一个个上去没几回合就一缕魂魄飞向封神台。</p>\n<p>之前对封神榜出现了一些神话人物，比如哪吒杨戬申公豹姜子牙土形孙还有天上飞的那个雷震子都有一些印象，想着借听封神榜，然后再熟悉一下，结果发现和我之前熟悉的差不多。该熟悉的还是那么熟悉，不熟悉的也没咋记住。可能别的就多记了一些什比干，闻仲，黄飞虎，还有通天教主，老子，还有元始天尊，别的一些什么十二金仙，还有闻仲请的那些魔家四将，算是多了一点印象。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-06-29/2024%E4%BA%94%E4%B8%80%E8%AF%B7%E5%AE%A2/",
            "url": "http://yun.fan/2024-06-29/2024%E4%BA%94%E4%B8%80%E8%AF%B7%E5%AE%A2/",
            "title": "2024五一请客",
            "date_published": "2024-06-29T02:32:03.000Z",
            "content_html": "<p>今天是2024年5月26号，星期日，虽然现在还躺床上，但是今天天气很好，雨后复斜阳，空气赶干净清爽。想写点什么，发现遗留的这个题目，既然如此，我得应付一二。</p>\n<a id=\"more\"></a>\n\n<p>五一我哥让去吃饭，其实那时候家里的饭已经做好了，娃她妈还抱怨说，不吃早说，饭做你的份了，于是我就在家里吃了，然后才去的。</p>\n<p>我妹妹去了，另外就是我的两个堂哥，还去了一个人，也是亲戚，算是小时候的玩伴，是我大舅家的孩子，小时候一起山上放羊打扑克牌，后来我在求学之路越走越远，而他半道就出社会了，很久没见了。</p>\n<p>来的大多数人都吃过饭了，我基本上一口都没吃，大家一起玩一个喝酒的游戏，叫梦幻，大体和炸金花差不多，输了喝酒，开始不会，后来玩了几把，也学会了，他们喝酒的法子变化真快，我记得上一次一起喝酒，他们用的是骰子🎲，当时我也不会，因为那次饭局有个我不认识的人，滔滔不绝连绵不断，都是一些低俗的情节，我没啥兴趣，就结了账老早撤了，那个玩骰子的技术也没学会。</p>\n<p>后来我妹说一会要走，我也说我要回家，虽然喝酒挺高兴挺好玩的，但是没有不散的宴席，何况大家终归各有其道，一年也就见面几次，没有什么好聊的，然后我去结了账，多要了一箱啤酒，一共500多，然后我坐我妹的摩托车回家了。</p>\n<p>回想我坐车的往事，最早应该是我小舅的三轮车，那个时候路还没有水泥化，都是沙石路，坐在三轮车后面的车厢上，旁边就是悬崖峭壁，百丈深渊，现在想想依然觉得好危险好害怕。</p>\n<p>而后来就是我哥哥的摩托车，然后他的小汽车，今天我又坐我妹妹的摩托车，而我还没能让他们坐上我的什么车，真是惭愧啊。</p>\n<p>那就这样吧，多了一些被唤起的记忆，今天写这些，后面的记忆又多了一些难忘的时刻。</p>\n",
            "tags": []
        },
        {
            "id": "http://yun.fan/2024-05-17/%E5%8F%88%E8%A7%81%E5%BD%93%E5%B9%B4%E4%BA%BA%E4%BB%8E%E4%BC%97/",
            "url": "http://yun.fan/2024-05-17/%E5%8F%88%E8%A7%81%E5%BD%93%E5%B9%B4%E4%BA%BA%E4%BB%8E%E4%BC%97/",
            "title": "又见当年人从众",
            "date_published": "2024-05-16T19:04:24.000Z",
            "content_html": "<p>这个题目是我2024年五一返程回北京写的，我就不去查准确时间是几号了，这个题目主要写的是坐火车，人很多，人挤人，和当年毕业工作前几年很像。</p>\n<a id=\"more\"></a>\n\n<p>因为我们县城到西安的高速路在维修，铁路突然也开始维修了，以至于去西安要绕路很久，原本一个半小时的车程，现在要3-4-5个小时，耗时差这么多，主要是我还没有亲身体会，我从一些坐车的聊天中听见的，有说3小时的，有说4小时的，有说5小时的，总之肯定很远，因为绕路都绕到我老家附近的一个镇上了，我从县城回老家基本都需要2个小时。</p>\n<p>从人的聊天中，很多人也和我有一样的想法，之前坐火车人很多，站都没地方站，的确这样的场景我是经历过的，十几个小时的车程我买过站票，的确是没有落脚地方，我记得我背了一个包，包放在一个火车硬座座位下，而我离这个座位好远，以我谨慎的性格，不到万不得已的时候，我是不会让贵重物品离我视线这么远的。</p>\n<p>这次从县城到西安火车人多，主要原因是修路造成的，要不然私家车，高速路都可以去西安，真正坐火车的人没那么多。</p>\n<p>生活处处有回忆啊，一些人或者事情，总能勾起当年的回忆，那些记忆原本已经尘封，如果不是有人提及，可能就相当于没有发生了。所以回忆有时候挺好的，让过往云烟再现，也让现在的生活多了几分乐趣。</p>\n",
            "tags": []
        }
    ]
}